Reports/МедицинскийОтчет007у.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>МедицинскийОтчет007у</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеКойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеКойкоМеста</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийКойкоМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровHTML</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеМедицинскихОтчетов007у.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеМедицинскихОтчетов007у</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧислоКоек</Name>
					<Comment>Колонка2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоНедоступныхКоек</Name>
					<Comment>Колонка3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаНачалоПериода</Name>
					<Comment>Колонка4</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступило</Name>
					<Comment>Колонка5</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоИзДневногоСтационара</Name>
					<Comment>Колонка6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоСельскихЖителей</Name>
					<Comment>Колонка7</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоНесовершеннолетних</Name>
					<Comment>Колонка8</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка9</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноИзДругихОтделений</Name>
					<Comment>Колонка10</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноВДругиеОтделения</Name>
					<Comment>Колонка11</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписано</Name>
					<Comment>Колонка12</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка13</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноВДневнойСтационар</Name>
					<Comment>Колонка14</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноВКруглосуточныйСтационар</Name>
					<Comment>Колонка15</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Умерло</Name>
					<Comment>Колонка16</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УмерлоНесовершеннолетних</Name>
					<Comment>Колонка17</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УмерлоСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка18</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаКонецПериода</Name>
					<Comment>Колонка19</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка20</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаконныхПредставителейНаКонецПериода</Name>
					<Comment>Колонка21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныхМестМужских</Name>
					<Comment>Колонка22</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныхМестЖенских</Name>
					<Comment>Колонка23</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Comment>Колонка1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/МедицинскийОтчет007у/Ext/ObjectModule.bsl
#Область РазделОписанияПеременных
Перем мВерсияОтчета Экспорт;// Строка, версия отчета
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Таблица форм отчета
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица форм отчета.
//
Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета";
	НоваяФорма.ОписаниеОтчета     = "";
	НоваяФорма.РедакцияФормы      = "";
	НоваяФорма.ДатаНачалоДействия = '20010101';
	НоваяФорма.ДатаКонецДействия  = МедицинскаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
			
	Возврат ТаблицаФормОтчета;
	
КонецФункции

// Периодичность отчета.
//
// Параметры:
//  ПараметрыОтчета	 - Неопределено - не используется.
// 
// Возвращаемое значение:
//  Строка - периодичность Год, Полугодие, Квартал, Месяц, День.
//
Функция ПериодичностьОтчета(ПараметрыОтчета = Неопределено) Экспорт
	
	Возврат "День"; // "Год,Полугодие,Квартал,Месяц,День".
	
КонецФункции

// Структура страниц отчета.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  мДеревоСтраницОтчета - ДанныеФормыДерево - дерево страниц отчета
//
Процедура ФормироватьСтруктуруСтраницОтчета(ВыбраннаяФорма, мДеревоСтраницОтчета) Экспорт
	
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Оборот";
	СтрокаУровня1.Представление            = "Оборот";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;

	
КонецПроцедуры

// Установить доступность областей.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  Форма				 - ФормаКлиентскогоПриложения - форма 
//  ИмяСтраницыПанели	 - Строка - имя страницы панели.
//
Процедура УстановитьДоступностьОбластей(ВыбраннаяФорма, Форма, ИмяСтраницыПанели = "") Экспорт
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	
	ЗапрещенныеОбласти = Новый Массив;
	ЗапрещенныеОбласти.Добавить("ШапкаОтчета");
	ЗапрещенныеОбласти.Добавить("ШапкаТаблицы");
	ЗапрещенныеОбласти.Добавить("ПромежуточнаяСтрока");
	ЗапрещенныеОбласти.Добавить("СтрокаВсего");
	ЗапрещенныеОбласти.Добавить("ОтчетГод");
	ЗапрещенныеОбласти.Добавить("ДатаЗаголовок");
	ЗапрещенныеОбласти.Добавить("Подпись");
	ЗапрещенныеОбласти.Добавить("Шапка");
	ЗапрещенныеОбласти.Добавить("Дата");
	
	ОбластиРучноеРедактирование = Новый Массив;
	ОбластиРучноеРедактирование.Добавить("ФИОПодпись");
	ОбластиРучноеРедактирование.Добавить("КодОКУД");
	ОбластиРучноеРедактирование.Добавить("Подразделение");
	ОбластиРучноеРедактирование.Добавить("Всего7");
	ОбластиРучноеРедактирование.Добавить("Всего16");
	ОбластиРучноеРедактирование.Добавить("Всего17");
	ОбластиРучноеРедактирование.Добавить("Всего18");
	ОбластиРучноеРедактирование.Добавить("Всего21");
	
	Для Каждого Область Из ТабДокумент.Области Цикл
		Если ЗапрещенныеОбласти.Найти(Область.Имя) = Неопределено И ОбластиРучноеРедактирование.Найти(Область.Имя) = Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_4"], Область);
		ИначеЕсли ОбластиРучноеРедактирование.Найти(Область.Имя) <>  Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_0"], Область);	
		КонецЕсли; 		
	КонецЦикла;
		
	мНомераКолонокСтрокой = Новый Массив;
	мНомераКолонокСтрокой.Добавить("001");
	
	ЗапретРедактированияДляКолонокДинамическойТаблицы(Форма, "Титульный", ИмяСтраницыПанели, "СтрокаТаблицы", мНомераКолонокСтрокой);
	
	мНомераКолонокСтрокой = Новый Массив;
	мНомераКолонокСтрокой.Добавить("007");
	мНомераКолонокСтрокой.Добавить("016");
	мНомераКолонокСтрокой.Добавить("017");
	мНомераКолонокСтрокой.Добавить("018");
	мНомераКолонокСтрокой.Добавить("021");
	
	РучноеРедактированиеДляКолонокДинамическойТаблицы(Форма, "Титульный", ИмяСтраницыПанели, "СтрокаТаблицы", мНомераКолонокСтрокой);
	
	мНомераКолонокСтрокой = Новый Массив;
	мНомераКолонокСтрокой.Добавить("006");
	
	РучноеРедактированиеДляКолонокДинамическойТаблицы(Форма, "Оборот", ИмяСтраницыПанели, "Строка", мНомераКолонокСтрокой);
	
КонецПроцедуры

Процедура ЗапретРедактированияДляКолонокДинамическойТаблицы(Форма, ИмяСтраницы, ИмяСтраницыПанели, ИмяОбластиСтроки, мНомераКолонокСтрокой = Неопределено)
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	Если ИмяСтраницыПанели = ИмяСтраницы Тогда
		Для Каждого Область Из ТабДокумент.Области Цикл	
			Если СтрНайти(Область.Имя, ИмяОбластиСтроки) <> 0 Тогда
				Если мНомераКолонокСтрокой <> Неопределено
					И СтрНайти(Область.Имя, "Шапка") = 0 
				Тогда
					ПозицияРазделителяДинамТаблицы = СтрНайти(Область.Имя, "__");
					НомерКолонки = Лев(Прав(Область.Имя, СтрДлина(Область.Имя) - ПозицияРазделителяДинамТаблицы - 1), 3);
					Если мНомераКолонокСтрокой.Найти(НомерКолонки) <> Неопределено Тогда
						Область.Защита = Истина;
						Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];
					Иначе
						Область.Защита = Ложь;
						Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_4"];		
					КонецЕсли;		
				Иначе
					Область.Защита = Истина;
					Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РучноеРедактированиеДляКолонокДинамическойТаблицы(Форма, ИмяСтраницы, ИмяСтраницыПанели, ИмяОбластиСтроки, мНомераКолонокСтрокой = Неопределено)
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	Если ИмяСтраницыПанели = ИмяСтраницы Тогда
		Для Каждого Область Из ТабДокумент.Области Цикл	
			Если СтрНайти(Область.Имя, ИмяОбластиСтроки) <> 0 Тогда
				Если мНомераКолонокСтрокой <> Неопределено
					И СтрНайти(Область.Имя, "Шапка") = 0 
				Тогда
					ПозицияРазделителяДинамТаблицы = СтрНайти(Область.Имя, "__");
					НомерКолонки = Лев(Прав(Область.Имя, СтрДлина(Область.Имя) - ПозицияРазделителяДинамТаблицы - 1), 3);
					Если мНомераКолонокСтрокой.Найти(НомерКолонки) <> Неопределено Тогда
						Область.Защита = Ложь;
						Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_0"];		
					КонецЕсли;			
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовокФормы() Экспорт
	
	Возврат "Форма 007/у. Лист ежедневного учета движения пациентов и коечного фонда медицинской организации";	
	
КонецФункции

#Область АлгоритмЗаполнения

// Заполнить отчет.
//
// Параметры:
//  ВыбраннаяФорма			 - ФормаКлиентскогоПриложения	 - форма
//  ПараметрыОтчета			 - Структура					 - параметры отчета
//  ЭтаФорма				 - ФормаКлиентскогоПриложения	 - форма
//  СтруктураРеквизитовФормы - Структура					 - структура реквизитов формы.
//
Процедура ЗаполнитьОтчет(ВыбраннаяФорма, ПараметрыОтчета, ЭтаФорма, СтруктураРеквизитовФормы) Экспорт 
	
	Попытка
		Подразделение = ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("Подразделение").Значение;
		Титульный = Истина;
	Исключение
		Титульный = Ложь;
	КонецПопытки;
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("МногострочныеДанные");
	Контейнер.Вставить("Дата", ПараметрыОтчета.мДатаКонцаПериодаОтчета + 1);
	Контейнер.Вставить("ВсегоДанные");
	Контейнер.Вставить("НаименованиеАдресЛПУ");	
	Контейнер.Вставить("МногострочныеДанныеКлиенты");
	
	МВТ = ПолучитьВременныеТаблицыДанных(Подразделение, ПараметрыОтчета.мДатаКонцаПериодаОтчета);
		
	Контейнер.НаименованиеАдресЛПУ = ПараметрыОтчета.Филиал.НазваниеОрганизации + " " + КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ПараметрыОтчета.Филиал, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Контейнер.МногострочныеДанныеКлиенты = ПолучитьТаблицуПоКлиентам(МВТ, Контейнер.Дата, Подразделение);
	
	Если Титульный Тогда
		Контейнер.МногострочныеДанные = ПолучитьТаблицуМногострочныеДанные(ПолучитьДанныеТаблицы(МВТ, ПараметрыОтчета.мДатаКонцаПериодаОтчета, Подразделение));
		Контейнер.ВсегоДанные = ПолучитьСуммарныеДанныеПоКолонкам(Контейнер.МногострочныеДанные);
		
		ВнестиСтрокуВТабличныйДокумент(ЭтаФорма, Контейнер.ВсегоДанные[0], "Титульный");
		ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, "Титульный", Контейнер.МногострочныеДанные, "СтрокаТаблицы",,Титульный);
	КонецЕсли;
	
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("НаименованиеАдресЛПУ",Контейнер.НаименованиеАдресЛПУ);
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("Дата",Контейнер.Дата);
	ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, "Оборот", Контейнер.МногострочныеДанныеКлиенты, "Строка",Истина,Истина);
	
КонецПроцедуры

Функция ПолучитьТаблицуМногострочныеДанные(ДанныеПоКойкам)
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	
	ТаблицаДанных.Колонки.Добавить("Колонка1");
	Для Счетчик = 2 По 25 Цикл
		ТаблицаДанных.Колонки.Добавить("Колонка" + Строка(Счетчик), Новый ОписаниеТипов("Число"));
	КонецЦикла;
	
	Для Строка = 0 По ДанныеПоКойкам.ДанныеПоКоличествуКоек.Количество() - 1 Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Колонка1 = ДанныеПоКойкам.ДанныеПоКоличествуКоек[Строка].Профиль;
		
		КлиентыНаНачалоПериода 				= ДанныеПоКойкам.КлиентыНаНачалоПериода.Найти(НоваяСтрока.Колонка1);
		ОборотКлиентов						= ДанныеПоКойкам.ОборотКлиентов.Найти(НоваяСтрока.Колонка1);
		КлиентыПоступившиеПереведенные 		= ДанныеПоКойкам.КлиентыПоступившиеПереведенные.Найти(НоваяСтрока.Колонка1);
		ВыписанныеКлиенты 					= ДанныеПоКойкам.ВыписанныеКлиенты.Найти(НоваяСтрока.Колонка1);
		КлиентыВыписанныеВДругиеОрганизации = ДанныеПоКойкам.КлиентыВыписанныеВДругиеОрганизации.Найти(НоваяСтрока.Колонка1); 
		КлиентыНаКонецПериода 				= ДанныеПоКойкам.КлиентыНаКонецПериода.Найти(НоваяСтрока.Колонка1);
		СвободныеКойкиМЖ 					= ДанныеПоКойкам.СвободныеКойкиМЖ.Найти(НоваяСтрока.Колонка1);
		
		НоваяСтрока.Колонка2 = ДанныеПоКойкам.ДанныеПоКоличествуКоек[Строка].ЧислоКоек;
		НоваяСтрока.Колонка3 = ДанныеПоКойкам.ДанныеПоКоличествуКоек[Строка].ЧислоНедоступныхКоек;
		Если КлиентыНаНачалоПериода <> Неопределено Тогда 
			НоваяСтрока.Колонка4 = КлиентыНаНачалоПериода.КлиентовНаНачалоПериода;
		КонецЕсли;
		Если ОборотКлиентов <> Неопределено Тогда
			НоваяСтрока.Колонка5 = ОборотКлиентов.Поступило;
			НоваяСтрока.Колонка6 = ОборотКлиентов.ПоступилоИзДневногоСтационара;
			НоваяСтрока.Колонка8 = ОборотКлиентов.ПоступилоНесовершеннолетних;
			НоваяСтрока.Колонка9 = ОборотКлиентов.ПоступилоСтаршеТрудоспособногоВозраста;
		КонецЕсли;
		Если КлиентыПоступившиеПереведенные <> Неопределено Тогда
			НоваяСтрока.Колонка10 = КлиентыПоступившиеПереведенные.ПереведеноИзДругихОтделений;
			НоваяСтрока.Колонка11 = КлиентыПоступившиеПереведенные.ПереведеноВДругиеОтделения;
			
			НоваяСтрока.Колонка24 = КлиентыПоступившиеПереведенные.ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста;
			НоваяСтрока.Колонка25 = КлиентыПоступившиеПереведенные.ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста;
		КонецЕсли;
		Если ВыписанныеКлиенты <> Неопределено Тогда
			НоваяСтрока.Колонка12 = ВыписанныеКлиенты.Выписано;
			НоваяСтрока.Колонка13 = ВыписанныеКлиенты.ВыписаноСтаршеТрудоспособногоВозраста;
		КонецЕсли;
		Если КлиентыВыписанныеВДругиеОрганизации <> Неопределено Тогда
			НоваяСтрока.Колонка14 = КлиентыВыписанныеВДругиеОрганизации.ВыписаноВДневнойСтационар;
			НоваяСтрока.Колонка15 = КлиентыВыписанныеВДругиеОрганизации.ВыписаноВКруглосуточныйСтационар;
		КонецЕсли;
		Если КлиентыНаКонецПериода <> Неопределено Тогда
			НоваяСтрока.Колонка19 = КлиентыНаКонецПериода.КлиентовНаКонецПериода;
			НоваяСтрока.Колонка20 = КлиентыНаКонецПериода.КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста;
		КонецЕсли;
		Если СвободныеКойкиМЖ <> Неопределено Тогда
			НоваяСтрока.Колонка22 = СвободныеКойкиМЖ.СвободныхМестМужских;
			НоваяСтрока.Колонка23 = СвободныеКойкиМЖ.СвободныхМестЖенских;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьСуммарныеДанныеПоКолонкам(ДанныеПоКойкам)

	ТаблицаДанных = Новый ТаблицаЗначений();
	
	Для Счетчик = 2 По 25 Цикл
		ТаблицаДанных.Колонки.Добавить("Колонка" + Строка(Счетчик));
	КонецЦикла;
	
	СтрокаСуммы = ТаблицаДанных.Добавить();
	
	Для Счетчик = 2 По 25 Цикл
		СтрокаСуммы["Колонка" + Счетчик] = ПолучитьСуммуПоКолонке(ДанныеПоКойкам, "Колонка" + Счетчик);
	КонецЦикла;
	
	Возврат ТаблицаДанных; 
		
КонецФункции

Функция ПолучитьСуммуПоКолонке(ДанныеПоКойкам, Колонка)
	
	Сумма = 0;
	
	Попытка 
		Для Каждого Строка Из ДанныеПоКойкам Цикл
			Сумма = Сумма + Строка[Колонка];
		КонецЦикла;
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат Сумма;
	
КонецФункции

Функция ПолучитьДанныеТаблицы(МВТ, Период, Подразделение) Экспорт
	
	НачалоПериода = Дата(Год(Период), Месяц(Период), День(Период), 9, 0, 0);
	КонецПериода = Дата(Год(Период + 1), Месяц(Период + 1), День(Период + 1), 8, 59, 59);
	
	ТаблицыДанных = Новый Структура;
		
	ТаблицыДанных.Вставить("ДанныеПоКоличествуКоек",ПолучитьДанныеПоКоличествуКоек(МВТ));
	ТаблицыДанных.Вставить("КлиентыНаНачалоПериода",ПолучитьКлиентовНаНачалоПериода(МВТ, НачалоПериода, Подразделение));
	ТаблицыДанных.Вставить("ОборотКлиентов",ПолучитьОборотКлиентов(МВТ, НачалоПериода, Подразделение));
	ТаблицыДанных.Вставить("КлиентыПоступившиеПереведенные",ПолучитьЧислоПоступившихПереведенных(МВТ, НачалоПериода, Подразделение));
	ТаблицыДанных.Вставить("ВыписанныеКлиенты",ПолучитьЧислоВыписанныхКлиентов(МВТ, НачалоПериода, Подразделение));
	ТаблицыДанных.Вставить("КлиентыВыписанныеВДругиеОрганизации",ПолучитьЧислоКлиентовВыписанныхВДругиеОрганизации(МВТ, Подразделение));
	ТаблицыДанных.Вставить("КлиентыНаКонецПериода",ПолучитьКлиентовНаКонецПериода(МВТ, КонецПериода, Подразделение));
	ТаблицыДанных.Вставить("СвободныеКойкиМЖ",ПолучитьСвободныеКойкиМЖ(МВТ, КонецПериода, Подразделение));
		
	Возврат ТаблицыДанных;
	
КонецФункции

Функция ПолучитьТаблицуПоКлиентам(МВТ, Период, Подразделение)
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	
	Для Счетчик = 1 По 6 Цикл
		ТаблицаДанных.Колонки.Добавить("Колонка" + Строка(Счетчик));
	КонецЦикла;
	
	ДанныеПоКлиентам = ПолучитьДанныеПоКлиентам(МВТ, Период, Подразделение);
	
	ПоступившиеКлиенты = ДанныеПоКлиентам.ПоступившиеКлиенты;
	ПоступившиеКлиентыИзвне = ДанныеПоКлиентам.ПоступившиеКлиентыИзвне;
	ВыписанныеКлиенты = ДанныеПоКлиентам.ВыписанныеКлиенты;
	ПереведенныеКлиенты = ДанныеПоКлиентам.ПереведенныеКлиенты;
	КлиентыПереведенныеВДругиеОгранизации = ДанныеПоКлиентам.КлиентыПереведенныеВДругиеОгранизации;
	
	Для Каждого Клиент Из КлиентыПереведенныеВДругиеОгранизации Цикл
		Индекс = ВыписанныеКлиенты.Найти(Клиент);
		Если Индекс <> Неопределено Тогда
			ВыписанныеКлиенты.Удалить(Индекс);	
		КонецЕсли;
	КонецЦикла;
	
	ЧислоСтрок = Макс(ПоступившиеКлиенты.Количество(),ПоступившиеКлиентыИзвне.Количество(),ВыписанныеКлиенты.Количество(),
				КлиентыПереведенныеВДругиеОгранизации.Количество(), ПереведенныеКлиенты.Количество());
	
	Для Счетчик = 0 По ЧислоСтрок - 1 Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		Если Счетчик <= ПоступившиеКлиенты.Количество() - 1 Тогда 
			НоваяСтрока.Колонка1 = ПоступившиеКлиенты[Счетчик];
		КонецЕсли;
		Если Счетчик <= ПоступившиеКлиентыИзвне.Количество() - 1 Тогда	
			НоваяСтрока.Колонка2 = ПоступившиеКлиентыИзвне[Счетчик];
		КонецЕсли;
		Если Счетчик <= ВыписанныеКлиенты.Количество() - 1 Тогда
			НоваяСтрока.Колонка3 = ВыписанныеКлиенты[Счетчик];
		КонецЕсли;
		Если Счетчик <= ПереведенныеКлиенты.Количество() - 1 Тогда
			НоваяСтрока.Колонка4 = ПереведенныеКлиенты[Счетчик];
		КонецЕсли;
		Если Счетчик <= КлиентыПереведенныеВДругиеОгранизации.Количество() - 1 Тогда
			НоваяСтрока.Колонка5 = КлиентыПереведенныеВДругиеОгранизации[Счетчик];
		КонецЕсли;
	КонецЦикла;
	
	Для Счетчик = 0 По ЧислоПустыхСтрокДляОборота() - 1 Цикл
		ТаблицаДанных.Добавить();	
	КонецЦикла;
	
	Возврат ТаблицаДанных;	
	
КонецФункции

Процедура ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, ИмяРаздела, Таблица, ИмяОбластиСтрок, ВыводитьПустыеСтроки = Ложь, ОчищатьТаблицу = Ложь)
	
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	МаксКол = Таблица.Колонки.Количество();	
	
	Если ОчищатьТаблицу Тогда
		Для Каждого КлючИЗначение Из СтруктураДанных Цикл
			Если СтрНайти(КлючИЗначение.Ключ, ИмяОбластиСтрок + "__") Тогда
				СтруктураДанных.Удалить(КлючИЗначение.Ключ);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Стр = 1;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = 0 По МаксКол - 1 Цикл
			ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(Сч + 1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);	
			Значение = СтрокаТаблицы[Сч]; 
			Если ЗначениеЗаполнено(Значение) Или ВыводитьПустыеСтроки Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВнестиСтрокуВТабличныйДокумент(ЭтаФорма, ДанныеСтроки, Раздел);
	
	Для Счетчик = 2 По 25 Цикл
		ЭтаФорма["СтруктураДанныхСтраниц"][Раздел].Вставить("Всего" + Счетчик,ДанныеСтроки["Колонка" + Счетчик]);
	КонецЦикла;		
	
КонецПроцедуры
 
#КонецОбласти

#Область Расшифровка

// Установить параметры расшифровки.
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма
//  ПараметрыОтчета	 - Структура - параметры отчета 
//  ИмяЯчейки		 - Строка - имя ячейки
// 
// Возвращаемое значение:
//  Структура - параметры расшифровки.
//
Функция УстановитьПараметрыРасшифровки(ВыбраннаяФорма, ПараметрыОтчета, ИмяЯчейки) Экспорт
	
	Возврат Неопределено;

КонецФункции

#КонецОбласти

Процедура ВнестиТаблицуВТабДокумент(ЭтаФорма, СтруктураРеквизитовФормы, ИмяРаздела, Таблица, КолонкаСтарт = 0, СтруктураДанныхИсходная = Неопределено)

	Если Таблица = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	ТабДокумент = ЭтаФорма.ПолеТабличногоДокументаФормаОтчета;
	МаксКол = Таблица.Колонки.Количество();
	Стр = 1;
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	ЗаноситьВчейки = СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = КолонкаСтарт По МаксКол - 1 Цикл
			ИмяЯчейки = "П010000101" + Формат(Сч + 1 - КолонкаСтарт, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
			Значение = СтрокаТаблицы[Сч];
			Если ЗаноситьВчейки Тогда
				ТабДокумент.Области[ИмяЯчейки].Значение = Значение;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(Значение) Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла; 
	
КонецПроцедуры
 
// Получить список разделов для загрузки
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма 
// 
// Возвращаемое значение:
//  Массив -  разделы для загрузки.
//
Функция ПолучитьСписокРазделовДляЗагрузки(ВыбраннаяФорма) Экспорт
	
	СписокРазделовДляЗагрузки = Новый Массив;
	СписокРазделовДляЗагрузки.Добавить("Титульный");
	СписокРазделовДляЗагрузки.Добавить("Оборот");

	Возврат СписокРазделовДляЗагрузки;
	
КонецФункции

#Область ЗаполнениеДанныхТаблиц

Функция ПолучитьВременныеТаблицыДанных(Подразделение, Период)
	
	НачалоПериода = Дата(Год(Период), Месяц(Период), День(Период), 9, 0, 0);
	КонецПериода = Дата(Год(Период + 1), Месяц(Период + 1), День(Период + 1), 8, 59, 59);
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДвижениеКоечногоФондаСрезПоследних.Палата.Профиль КАК Профиль,
	               |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК Койка,
	               |	ДвижениеКоечногоФондаСрезПоследних.Палата КАК Палата,
	               |	ДвижениеКоечногоФондаСрезПоследних.Палата.Гендер КАК ПалатаГендер,
	               |	ДвижениеКоечногоФондаСрезПоследних.Статус КАК Статус,
	               |	&Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	РегистрСведений.ДвижениеКоечногоФонда.СрезПоследних(&КонецПериода, Палата.Подразделение = &Подразделение) КАК ДвижениеКоечногоФондаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыСтационара.Период КАК Период,
	               |	КлиентыСтационара.Регистратор КАК Регистратор,
	               |	КлиентыСтационара.Клиент КАК Клиент,
	               |	КлиентыСтационара.ДокументПоступления КАК ДокументПоступления,
	               |	КлиентыСтационара.Подразделение КАК Подразделение,
	               |	КлиентыСтационара.КойкоМесто КАК КойкоМесто,
	               |	КлиентыСтационара.ДатаНачала КАК ДатаНачала,
	               |	КлиентыСтационара.ДатаОкончания КАК ДатаОкончания,
	               |	КлиентыСтационара.Выписан КАК Выписан
	               |ПОМЕСТИТЬ КлиентыЗаПериод
	               |ИЗ
	               |	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	               |ГДЕ
	               |	КлиентыСтационара.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыЗаПериод.Регистратор КАК Регистратор,
	               |	КлиентыЗаПериод.Клиент КАК Клиент,
	               |	КлиентыЗаПериод.ДокументПоступления КАК ДокументПоступления,
	               |	МАКСИМУМ(КлиентыСтационара.ДатаНачала) КАК ДатаНачала
	               |ПОМЕСТИТЬ ДатыПредыдущихУстановокУсловий
	               |ИЗ
	               |	КлиентыЗаПериод КАК КлиентыЗаПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	               |		ПО КлиентыЗаПериод.Клиент = КлиентыСтационара.Клиент
	               |			И КлиентыЗаПериод.ДокументПоступления = КлиентыСтационара.ДокументПоступления
	               |			И КлиентыЗаПериод.ДатаНачала > КлиентыСтационара.ДатаНачала
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыЗаПериод.Регистратор,
	               |	КлиентыЗаПериод.Клиент,
	               |	КлиентыЗаПериод.ДокументПоступления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДатыПредыдущихУстановокУсловий.Регистратор КАК Регистратор,
	               |	КлиентыСтационара.Клиент КАК Клиент,
	               |	КлиентыСтационара.ДокументПоступления КАК ДокументПоступления,
	               |	КлиентыСтационара.КойкоМесто КАК КойкоМесто,
	               |	КлиентыСтационара.Подразделение КАК Подразделение,
	               |	Данные.Профиль КАК Профиль
	               |ПОМЕСТИТЬ ПредыдущиеУУ
	               |ИЗ
	               |	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПредыдущихУстановокУсловий КАК ДатыПредыдущихУстановокУсловий
	               |		ПО КлиентыСтационара.Клиент = ДатыПредыдущихУстановокУсловий.Клиент
	               |			И КлиентыСтационара.ДокументПоступления = ДатыПредыдущихУстановокУсловий.ДокументПоступления
	               |			И КлиентыСтационара.ДатаНачала = ДатыПредыдущихУстановокУсловий.ДатаНачала
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
	               |		ПО КлиентыСтационара.КойкоМесто = Данные.Койка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыЗаПериод.Период КАК Период,
	               |	КлиентыЗаПериод.Регистратор КАК Регистратор,
	               |	КлиентыЗаПериод.Регистратор.ДокументОбращения.ВидСтационараНаправления КАК РегистраторДокументОбращенияВидСтационараНаправления,
	               |	КлиентыЗаПериод.Регистратор.ВидОперации КАК РегистраторВидОперации,
	               |	КлиентыЗаПериод.Клиент КАК Клиент,
	               |	КлиентыЗаПериод.Клиент.ДатаРождения КАК КлиентДатаРождения,
	               |	КлиентыЗаПериод.Клиент.Пол КАК КлиентПол,
	               |	КлиентыЗаПериод.ДокументПоступления КАК ДокументПоступления,
	               |	КлиентыЗаПериод.Подразделение КАК Подразделение,
	               |	КлиентыЗаПериод.КойкоМесто КАК КойкоМесто,
	               |	Данные.Профиль КАК КойкоМестоПрофиль,
	               |	КлиентыЗаПериод.ДатаНачала КАК ДатаНачала,
	               |	КлиентыЗаПериод.ДатаОкончания КАК ДатаОкончания,
	               |	КлиентыЗаПериод.Выписан КАК Выписан,
	               |	ПредыдущиеУУ.Профиль КАК КойкоМестоПредыдущееВладелецПрофиль,
	               |	ПредыдущиеУУ.КойкоМесто КАК КойкоМестоПредыдущее,
	               |	ПредыдущиеУУ.Подразделение КАК ПодразделениеПредыдущее,
	               |	КлиентыЗаПериод.Регистратор.ДокументОбращения.МедицинскаяКарта КАК МедицинскаяКарта
	               |ПОМЕСТИТЬ КлиентыСтационара
	               |ИЗ
	               |	КлиентыЗаПериод КАК КлиентыЗаПериод
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущиеУУ КАК ПредыдущиеУУ
	               |		ПО КлиентыЗаПериод.Регистратор = ПредыдущиеУУ.Регистратор
	               |			И КлиентыЗаПериод.Клиент = ПредыдущиеУУ.Клиент
	               |			И КлиентыЗаПериод.ДокументПоступления = ПредыдущиеУУ.ДокументПоступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
	               |		ПО КлиентыЗаПериод.КойкоМесто = Данные.Койка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ КлиентыЗаПериод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДатыПредыдущихУстановокУсловий
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ПредыдущиеУУ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Результат = Запрос.Выполнить();
	
	Возврат МВТ;
	
КонецФункции

Функция ПолучитьДанныеПоКоличествуКоек(МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Профиль КАК Профиль,
	               |	СУММА(ВЫБОР
	               |			КОГДА Данные.Статус <> ЗНАЧЕНИЕ(Перечисление.СостоянияКоек.ПустаяСсылка)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЧислоНедоступныхКоек,
	               |	КОЛИЧЕСТВО(Данные.Койка) КАК ЧислоКоек
				   |ИЗ
	               |	Данные КАК Данные
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Профиль
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(Данные.Койка) > 0";
	
	Возврат Запрос.Выполнить().Выгрузить();		
	
КонецФункции

Функция ПолучитьКлиентовНаНачалоПериода(МВТ, Период, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Профиль КАК Профиль,
	               |	КОЛИЧЕСТВО(КлиентыСтационараСрезПоследних.Клиент) КАК КлиентовНаНачалоПериода
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСтационара.СрезПоследних(&Период, ) КАК КлиентыСтационараСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Период, ) КАК СостояниеКойкоМестаСрезПоследних
	               |			ПО КлиентыСтационараСрезПоследних.Регистратор = СостояниеКойкоМестаСрезПоследних.Регистратор
	               |		ПО Данные.Койка = КлиентыСтационараСрезПоследних.КойкоМесто
	               |ГДЕ
	               |	НЕ КлиентыСтационараСрезПоследних.Выписан
	               |	И &Период МЕЖДУ КлиентыСтационараСрезПоследних.ДатаНачала И ВЫБОР
	               |			КОГДА КлиентыСтационараСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	               |			ИНАЧЕ КлиентыСтационараСрезПоследних.ДатаОкончания
	               |		КОНЕЦ
	               |	И КлиентыСтационараСрезПоследних.Подразделение = &Подразделение
	               |	И СостояниеКойкоМестаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.ЗанятоПациентом)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Профиль";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьОборотКлиентов(МВТ, НачалоПериода, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Профиль КАК Профиль,
	               |	КОЛИЧЕСТВО(КлиентыСтационара.Клиент) КАК Поступило,
	               |	СУММА(ВЫБОР
	               |			КОГДА КлиентыСтационара.РегистраторДокументОбращенияВидСтационараНаправления = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.Дневной)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПоступилоИзДневногоСтационара,
	               |	СУММА(ВЫБОР
	               |			КОГДА КлиентыСтационара.КлиентДатаРождения > &ПорогСовершеннолетия
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПоступилоНесовершеннолетних,
	               |	СУММА(ВЫБОР
	               |			КОГДА КлиентыСтационара.КлиентДатаРождения < ВЫБОР
	               |					КОГДА КлиентыСтационара.КлиентПол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |						ТОГДА &ПорогНетрудоспособностиМ
	               |					ИНАЧЕ &ПорогНетрудоспособностиЖ
	               |				КОНЕЦ
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПоступилоСтаршеТрудоспособногоВозраста
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КлиентыСтационара КАК КлиентыСтационара
	               |		ПО Данные.Койка = КлиентыСтационара.КойкоМесто
	               |ГДЕ
	               |	КлиентыСтационара.Подразделение = &Подразделение
	               |	И НЕ КлиентыСтационара.Выписан
	               |	И КлиентыСтационара.РегистраторВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий)
				   |	И КлиентыСтационара.РегистраторВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Профиль";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПорогСовершеннолетия", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастСовершеннолетия())));
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиМ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиМ())));
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиЖ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиЖ()))); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЧислоПоступившихПереведенных(МВТ,НачалоПериода, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА &Подразделение <> КлиентыСтационара.Подразделение
	               |			ТОГДА КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль
	               |		ИНАЧЕ КлиентыСтационара.КойкоМестоПрофиль
	               |	КОНЕЦ КАК Профиль,
	               |	СУММА(ВЫБОР
	               |			КОГДА &Подразделение <> КлиентыСтационара.ПодразделениеПредыдущее
	               |					И &Подразделение = КлиентыСтационара.Подразделение
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереведеноИзДругихОтделений,
	               |	СУММА(ВЫБОР
	               |			КОГДА &Подразделение <> КлиентыСтационара.ПодразделениеПредыдущее
	               |					И &Подразделение = КлиентыСтационара.Подразделение
	               |					И КлиентыСтационара.КлиентДатаРождения < ВЫБОР
	               |						КОГДА КлиентыСтационара.КлиентПол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |							ТОГДА &ПорогНетрудоспособностиМ
	               |						ИНАЧЕ &ПорогНетрудоспособностиЖ
	               |					КОНЕЦ
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста,
	               |	СУММА(ВЫБОР
	               |			КОГДА &Подразделение = КлиентыСтационара.ПодразделениеПредыдущее
	               |					И &Подразделение <> КлиентыСтационара.Подразделение
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереведеноВДругиеОтделения,
	               |	СУММА(ВЫБОР
	               |			КОГДА &Подразделение = КлиентыСтационара.ПодразделениеПредыдущее
	               |					И &Подразделение <> КлиентыСтационара.Подразделение
	               |					И КлиентыСтационара.КлиентДатаРождения < ВЫБОР
	               |						КОГДА КлиентыСтационара.КлиентПол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |							ТОГДА &ПорогНетрудоспособностиМ
	               |						ИНАЧЕ &ПорогНетрудоспособностиЖ
	               |					КОНЕЦ
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
	               |ГДЕ
	               |	НЕ КлиентыСтационара.Выписан
	               |	И КлиентыСтационара.РегистраторВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА &Подразделение <> КлиентыСтационара.Подразделение
	               |			ТОГДА КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль
	               |		ИНАЧЕ КлиентыСтационара.КойкоМестоПрофиль
	               |	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиМ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиМ())));
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиЖ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиЖ()))); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЧислоВыписанныхКлиентов(МВТ, НачалоПериода, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль КАК Профиль,
	               |	КОЛИЧЕСТВО(КлиентыСтационара.Клиент) КАК Выписано,
	               |	СУММА(ВЫБОР
	               |			КОГДА КлиентыСтационара.КлиентДатаРождения < ВЫБОР
	               |					КОГДА КлиентыСтационара.КлиентПол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |						ТОГДА &ПорогНетрудоспособностиМ
	               |					ИНАЧЕ &ПорогНетрудоспособностиЖ
	               |				КОНЕЦ
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ВыписаноСтаршеТрудоспособногоВозраста
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
				   |ГДЕ
	               |	КлиентыСтационара.ПодразделениеПредыдущее = &Подразделение
	               |	И КлиентыСтационара.Выписан
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиМ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиМ())));
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиЖ", НачалоДня(ДобавитьМесяц(НачалоПериода, -12 * ВозрастНетрудоспособностиЖ()))); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЧислоКлиентовВыписанныхВДругиеОрганизации(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль КАК Профиль,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЗначенияПараметровHTML.Значение = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.Дневной)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ВыписаноВДневнойСтационар,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЗначенияПараметровHTML.Значение = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.Круглосуточный)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ВыписаноВКруглосуточныйСтационар
		               |ИЗ
		               |	КлиентыСтационара КАК КлиентыСтационара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
		               |		ПО ЗначенияПараметровHTML.Документ.МедицинскаяКарта = КлиентыСтационара.МедицинскаяКарта
		               |ГДЕ
		               |	КлиентыСтационара.ПодразделениеПредыдущее = &Подразделение
		               |	И КлиентыСтационара.Выписан
		               |	И ЗначенияПараметровHTML.Параметр.Назначение = ЗНАЧЕНИЕ(Перечисление.КодировкаПолейЭМД.ВидСтационара)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КлиентыСтационара.КойкоМестоПредыдущееВладелецПрофиль";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьКлиентовНаКонецПериода(МВТ, Период, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Профиль КАК Профиль,
	               |	КОЛИЧЕСТВО(КлиентыСтационараСрезПоследних.Клиент) КАК КлиентовНаКонецПериода,
	               |	СУММА(ВЫБОР
	               |			КОГДА КлиентыСтационараСрезПоследних.Клиент.ДатаРождения < ВЫБОР
	               |					КОГДА КлиентыСтационараСрезПоследних.Клиент.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |						ТОГДА &ПорогНетрудоспособностиМ
	               |					ИНАЧЕ &ПорогНетрудоспособностиЖ
	               |				КОНЕЦ
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСтационара.СрезПоследних(&Период, ) КАК КлиентыСтационараСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Период, ) КАК СостояниеКойкоМестаСрезПоследних
	               |			ПО КлиентыСтационараСрезПоследних.Регистратор = СостояниеКойкоМестаСрезПоследних.Регистратор
	               |		ПО Данные.Койка = КлиентыСтационараСрезПоследних.КойкоМесто
	               |ГДЕ
	               |	НЕ КлиентыСтационараСрезПоследних.Выписан
	               |	И &Период МЕЖДУ КлиентыСтационараСрезПоследних.ДатаНачала И ВЫБОР
	               |			КОГДА КлиентыСтационараСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	               |			ИНАЧЕ КлиентыСтационараСрезПоследних.ДатаОкончания
	               |		КОНЕЦ
	               |	И КлиентыСтационараСрезПоследних.Подразделение = &Подразделение
	               |	И СостояниеКойкоМестаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.ЗанятоПациентом)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Профиль";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиМ", НачалоДня(ДобавитьМесяц(Период, -12 * ВозрастНетрудоспособностиМ())));
	Запрос.УстановитьПараметр("ПорогНетрудоспособностиЖ", НачалоДня(ДобавитьМесяц(Период, -12 * ВозрастНетрудоспособностиЖ()))); 
	
	Возврат Запрос.Выполнить().Выгрузить();		
	
КонецФункции

Функция ПолучитьСвободныеКойкиМЖ(МВТ, Период, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Профиль КАК Профиль,
	               |	СУММА(ВЫБОР
	               |			КОГДА Данные.ПалатаГендер <> ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Женский)
	               |					И Данные.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияКоек.ПустаяСсылка)
	               |					И (СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.ЗанятоПациентом)
	               |							И СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Недоступно)
	               |						ИЛИ СостояниеКойкоМестаСрезПоследних.Состояние ЕСТЬ NULL
	               |						ИЛИ СостояниеКойкоМестаСрезПоследних.ДатаОкончания < &Период)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СвободныхМестМужских,
	               |	СУММА(ВЫБОР
	               |			КОГДА Данные.ПалатаГендер <> ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	               |					И Данные.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияКоек.ПустаяСсылка)
	               |					И (СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.ЗанятоПациентом)
	               |							И СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Недоступно)
	               |						ИЛИ СостояниеКойкоМестаСрезПоследних.Состояние ЕСТЬ NULL
	               |						ИЛИ СостояниеКойкоМестаСрезПоследних.ДатаОкончания < &Период)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СвободныхМестЖенских
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Период, ) КАК СостояниеКойкоМестаСрезПоследних
	               |		ПО Данные.Койка = СостояниеКойкоМестаСрезПоследних.КойкоМесто
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Профиль";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеПоКлиентам(МВТ,Период, Подразделение)
	
	НачалоПериода = Дата(Год(Период), Месяц(Период), День(Период), 9, 0, 0);
	КонецПериода = Дата(Год(Период + 1), Месяц(Период + 1), День(Период + 1), 8, 59, 59);
	
	МассивыКлиентов = Новый Структура;
	МассивыКлиентов.Вставить("ПоступившиеКлиенты",ПолучитьПоступившихКлиентов(МВТ, Подразделение));
	МассивыКлиентов.Вставить("ПоступившиеКлиентыИзвне",ПолучитьВнешнихКлиентов(МВТ, Подразделение));
	МассивыКлиентов.Вставить("ВыписанныеКлиенты",ПолучитьВыписанныхКлиентов(МВТ, Подразделение));
	МассивыКлиентов.Вставить("ПереведенныеКлиенты",ПолучитьПереведенныхКлиентов(МВТ, Подразделение));
	МассивыКлиентов.Вставить("КлиентыПереведенныеВДругиеОгранизации",ПолучитьКлиентовВыписанныхВДругиеОрганизации(МВТ, Подразделение));
	
	Возврат МассивыКлиентов;	
	
КонецФункции

Функция ПолучитьПоступившихКлиентов(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.Клиент КАК Клиент
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
	               |ГДЕ
	               |	КлиентыСтационара.РегистраторДокументОбращенияВидСтационараНаправления = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.ПустаяСсылка)	               
				   |	И КлиентыСтационара.РегистраторВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий)
				   |	И КлиентыСтационара.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

Функция ПолучитьВнешнихКлиентов(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.Клиент КАК Клиент
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
	               |ГДЕ
	               |	КлиентыСтационара.РегистраторДокументОбращенияВидСтационараНаправления <> ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.ПустаяСсылка)
	               |	И КлиентыСтационара.РегистраторВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий)
	               |	И КлиентыСтационара.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

Функция ПолучитьВыписанныхКлиентов(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.Клиент КАК Клиент
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
	               |ГДЕ
	               |	КлиентыСтационара.ПодразделениеПредыдущее = &Подразделение
				   |	И КлиентыСтационара.Выписан";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

Функция ПолучитьКлиентовВыписанныхВДругиеОрганизации(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.Клиент КАК Клиент
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	               |		ПО КлиентыСтационара.МедицинскаяКарта = ЗначенияПараметровHTML.Документ.МедицинскаяКарта
	               |ГДЕ
	               |	КлиентыСтационара.ПодразделениеПредыдущее = &Подразделение
				   |	И КлиентыСтационара.Выписан
				   |	И ЗначенияПараметровHTML.Параметр.Назначение = ЗНАЧЕНИЕ(Перечисление.КодировкаПолейЭМД.ВидСтационара)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

Функция ПолучитьПереведенныхКлиентов(МВТ, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационара.Клиент КАК Клиент
	               |ИЗ
	               |	КлиентыСтационара КАК КлиентыСтационара
				   |ГДЕ
				   |	&Подразделение = КлиентыСтационара.ПодразделениеПредыдущее
	               |	И &Подразделение <> КлиентыСтационара.Подразделение
				   |	И КлиентыСтационара.РегистраторВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями)";	
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Объект, СтруктураДанных, Отказ, ОписаниеОшибки) Экспорт
		
	Если СтруктураДанных.Свойство("СтруктураДанныхСтраниц") Тогда
		Движения = Объект.Движения.ДанныеМедицинскихОтчетов007у;
		Данные = СтруктураДанных.СтруктураДанныхСтраниц.Титульный;
		
		Если СуществуетДругой007(Объект.Ссылка, Данные.Подразделение, Данные.Дата) Тогда
			ОписаниеОшибки = "Отчет по этому подразделению на эту дату уже существует!";
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если СтрНайти(Объект.Комментарий, Строка(Данные.Подразделение)) = 0 Тогда
			Объект.Комментарий = ?(Данные.Подразделение = "", Строка(Данные.Подразделение), Строка(Данные.Подразделение) + ". " + Объект.Комментарий);
		КонецЕсли;                                                                    
		
		Строка = 1;
		ИмяСтроки = "СтрокаТаблицы__001_1";
		Пока Данные.Свойство(ИмяСтроки) Цикл
			
		    Запись = Движения.Добавить();
			
			Запись.Период 							= Данные.Дата;
			Запись.Подразделение 					= Данные.Подразделение;
			Запись.Профиль 							= Данные[ИмяСтроки];
			Запись.ЧислоКоек 						= ?(Данные.Свойство("СтрокаТаблицы__002_" + Строка), Данные["СтрокаТаблицы__002_" + Строка], 0);
			Запись.ЧислоНедоступныхКоек 			= ?(Данные.Свойство("СтрокаТаблицы__003_" + Строка), Данные["СтрокаТаблицы__003_" + Строка], 0);
			Запись.КлиентовНаНачалоПериода 			= ?(Данные.Свойство("СтрокаТаблицы__004_" + Строка), Данные["СтрокаТаблицы__004_" + Строка], 0);
			Запись.Поступило 						= ?(Данные.Свойство("СтрокаТаблицы__005_" + Строка), Данные["СтрокаТаблицы__005_" + Строка], 0);
			Запись.ПоступилоИзДневногоСтационара 	= ?(Данные.Свойство("СтрокаТаблицы__006_" + Строка), Данные["СтрокаТаблицы__006_" + Строка], 0);
			Запись.ПоступилоСельскихЖителей 		= ?(Данные.Свойство("СтрокаТаблицы__007_" + Строка), Данные["СтрокаТаблицы__007_" + Строка], 0);
			Запись.ПоступилоНесовершеннолетних 		= ?(Данные.Свойство("СтрокаТаблицы__008_" + Строка), Данные["СтрокаТаблицы__008_" + Строка], 0);
			Запись.ПоступилоСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__009_" + Строка), Данные["СтрокаТаблицы__009_" + Строка], 0);
			Запись.ПереведеноИзДругихОтделений 		= ?(Данные.Свойство("СтрокаТаблицы__010_" + Строка), Данные["СтрокаТаблицы__010_" + Строка], 0);
			Запись.ПереведеноВДругиеОтделения 		= ?(Данные.Свойство("СтрокаТаблицы__011_" + Строка), Данные["СтрокаТаблицы__011_" + Строка], 0);
			Запись.Выписано 						= ?(Данные.Свойство("СтрокаТаблицы__012_" + Строка), Данные["СтрокаТаблицы__012_" + Строка], 0);
			Запись.ВыписаноСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__013_" + Строка), Данные["СтрокаТаблицы__013_" + Строка], 0);
			Запись.ВыписаноВДневнойСтационар 		= ?(Данные.Свойство("СтрокаТаблицы__014_" + Строка), Данные["СтрокаТаблицы__014_" + Строка], 0);
			Запись.ВыписаноВКруглосуточныйСтационар = ?(Данные.Свойство("СтрокаТаблицы__015_" + Строка), Данные["СтрокаТаблицы__015_" + Строка], 0);
			Запись.Умерло 							= ?(Данные.Свойство("СтрокаТаблицы__016_" + Строка), Данные["СтрокаТаблицы__016_" + Строка], 0);
			Запись.УмерлоНесовершеннолетних 		= ?(Данные.Свойство("СтрокаТаблицы__017_" + Строка), Данные["СтрокаТаблицы__017_" + Строка], 0);
			Запись.УмерлоСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__018_" + Строка), Данные["СтрокаТаблицы__018_" + Строка], 0);
			Запись.КлиентовНаКонецПериода 			= ?(Данные.Свойство("СтрокаТаблицы__019_" + Строка), Данные["СтрокаТаблицы__019_" + Строка], 0);
			Запись.КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__020_" + Строка), Данные["СтрокаТаблицы__020_" + Строка], 0);
			Запись.ЗаконныхПредставителейНаКонецПериода = ?(Данные.Свойство("СтрокаТаблицы__021_" + Строка), Данные["СтрокаТаблицы__021_" + Строка], 0);
			Запись.СвободныхМестМужских				= ?(Данные.Свойство("СтрокаТаблицы__022_" + Строка), Данные["СтрокаТаблицы__022_" + Строка], 0);
			Запись.СвободныхМестЖенских 			= ?(Данные.Свойство("СтрокаТаблицы__023_" + Строка), Данные["СтрокаТаблицы__023_" + Строка], 0);
			Запись.ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__024_" + Строка), Данные["СтрокаТаблицы__024_" + Строка], 0);
			Запись.ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста = ?(Данные.Свойство("СтрокаТаблицы__025_" + Строка), Данные["СтрокаТаблицы__025_" + Строка], 0);
			
			Строка = Строка + 1;
			ИмяСтроки = "СтрокаТаблицы__001_" + Строка;
			
		КонецЦикла;
		
		Если Движения.Количество() = 0 Тогда
			Запись = Движения.Добавить();
			Запись.Период 			= Данные.Дата;
			Запись.Подразделение	= Данные.Подразделение;
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

Функция СуществуетДругой007(Объект, Подразделение, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеМедицинскихОтчетов007у.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.ДанныеМедицинскихОтчетов007у КАК ДанныеМедицинскихОтчетов007у
	               |ГДЕ
	               |	ДанныеМедицинскихОтчетов007у.Регистратор <> &Регистратор
	               |	И ДанныеМедицинскихОтчетов007у.Подразделение = &Подразделение
	               |	И ДанныеМедицинскихОтчетов007у.Период = &Период"; 
	
	Запрос.УстановитьПараметр("Регистратор",Объект);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Период",Дата);
	
	Возврат Запрос.Выполнить().Выбрать().Следующий();
	
КонецФункции

Процедура ПолеТабличногоДокументаВыбор(СтруктураДанных, ИмяОбласти, СтандартнаяОбработка) Экспорт
	
	ПоказатьДопКолонки(СтруктураДанных, ИмяОбласти);
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаПриИзменении(СтруктураДанных, ИмяОбласти) Экспорт
	
	ПоказатьДопКолонки(СтруктураДанных, ИмяОбласти);
	
КонецПроцедуры

Процедура ПоказатьДопКолонки(СтруктураДанных, ИмяОбласти)
	
	Если СтруктураДанных.Свойство("ТабДок") Тогда
		
		ИмяОбластиКолонки = Лев(ИмяОбласти, 19);
		Если ИмяОбластиКолонки = "СтрокаТаблицы__010_" 
			Или ИмяОбласти  = "Всего10" 
		Тогда
			СтруктураДанных.ТабДок.Область("C23").ШиринаКолонки = 11;	
		ИначеЕсли ИмяОбластиКолонки = "СтрокаТаблицы__011_" 
			Или ИмяОбласти  = "Всего11"	
		Тогда
			СтруктураДанных.ТабДок.Область("C25").ШиринаКолонки = 11;	
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область Константы

Функция ВозрастСовершеннолетия() Экспорт
	
	Возврат 18;
	
КонецФункции

Функция ВозрастНетрудоспособностиМ() Экспорт
	
	Возврат 65;
	
КонецФункции

Функция ВозрастНетрудоспособностиЖ() Экспорт
	
	Возврат 60;
	
КонецФункции

Функция ЧислоПустыхСтрокДляОборота()
	
	Возврат 3;
	
КонецФункции

#КонецОбласти

#КонецОбласти

мВерсияОтчета = "1.0";
